# Урок 3. Задание № 1
# 1. В диапазоне натуральных чисел от 2 до 99 определить,
# сколько из них кратны каждому из чисел в диапазоне от 2 до 9.
# -------------------------------------------------------------
# Задание выполнил студент GeekBrains  Турчин Богдан.
# -------------------------------------------------------------
MIN_ITEM = 2
MAX_ITEM = 100

MIN_NUM = 2
MAX_NUM = 10

count = 0
print('В диапазоне чисел от 2 до 99 кратно каждому числу в диапазоне от 2 до 9')
for i in range(MIN_NUM, MAX_NUM):
    for n in range(MIN_ITEM, MAX_ITEM):
        if n % i == 0:
            count += 1
    print(f'Кратно {i} - {count} чисел')
    count = 0
